Tekla Open API Reference for Tekla Structures 2025
AnalysisBeamEnd.Eccentricity Property
 Gets or sets the eccentricity at the beam end (in the member's local coordinate system).
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Eccentricity { get; set; }
Public Property Eccentricity As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
AnalysisBeamEnd Class
Tekla.Structures.Analysis Namespace